# GetBoundaries Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegion..::..GetBoundaries Method
FilledRegion Class See Also
---
Gets the boundaries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<CurveLoop> GetBoundaries()
```

Visual Basic
---
```text
Public Function GetBoundaries As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetBoundaries()
```

# ### Return Value
The filled region boundaries.
# See Also
FilledRegion Class
Autodesk.Revit.DB Namespace